app/controllers/charges_controller.rb

  def index
    # Here the original @charges was split into three different collections so they can be displayed separately
    @failed_charges = Charge.where(refunded: true)
    @disputed_charges = Charge.where(disputed: true)
    @successful_charges = Charge.where(refunded: false, disputed: false)
---
SELECT "charges".* FROM "charges" WHERE "charges"."refunded" = ?  [["refunded", 1]]
SELECT "charges".* FROM "charges" WHERE "charges"."disputed" = ?  [["disputed", 1]]
SELECT "charges".* FROM "charges" WHERE "charges"."refunded" = ? AND "charges"."disputed" = ?  [["refunded", 0], ["disputed", 0]]

  def create
    @charge = Charge.new(charge_params)

    respond_to do |format|
      if @charge.save
---
INSERT INTO "charges" ("paid", "amount", "currency", "refunded", "disputed", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @charge.destroy
---
DELETE FROM "charges" WHERE "charges"."id" = ?  [["id", 980190962]]

    def set_charge
      @charge = Charge.find(params[:id])
---
SELECT  "charges".* FROM "charges" WHERE "charges"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]