app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("firstname", "lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["firstname", "MyString"], ["lastname", "MyString"], ["created_at", "2018-10-11 03:45:20.104581"], ["updated_at", "2018-10-11 03:45:20.104581"]]