app/views/charges/index.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
        <td><%= charge.disputed %></td>
        <td><%= charge.customer.firstname + " " + charge.customer.lastname %></td>

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= charge.disputed %></td>
        <td><%= charge.customer.firstname + " " + charge.customer.lastname %></td>

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= charge.disputed %></td>
        <td><%= charge.customer.firstname + " " + charge.customer.lastname %></td>